dewayne57/PIC18F__Q43/03 I2C/I2C 02 Module Host/i2c.c
    handle->txBuffer = data;       // Set the transmit buffer pointer
    handle->txBufferSize = length; // Set the transmit buffer size
    handle->txBufferIndex = 0;     // Reset the transmit buffer index

    setupDeviceAddress(handle, deviceAddress, false); // Setup the device address
    PIE7bits.I2C1TXIE = 1;                            // Enable the transmit interrupt
    handle->state = I2C_WRITE;                        // Set the I2C bus state to write mode
    I2C1CNT = (uint8_t)length; // Set the I2C count register to the number of bytes to transmit
    I2C1CON0bits.RSEN = 0;     // Disable repeated start condition
    I2C1CON0bits.CSTR = 0;     // Release clock stretching before starting the transfer
    I2C1CON0bits.S = 1;        // Generate a start condition

    handle->lastStatus = I2C_OK; // Set the last state to OK
    return I2C_OK; // Return success status (actual write implementation is not provided)
}

/// @brief Read data from an I2C device.
/// @param handle Pointer to the I2C handle structure.
/// @param deviceAddress The I2C address of the device to read from.
/// @param data Pointer to the buffer to store the read data.
/// @param length The number of bytes to read from the device.
/// @return I2C status indicating success or failure.  The provided handle will be updated
/// with the read data if the function returns I2C_STATUS_SUCCESS.  If the function returns
/// I2C_STATUS_ERROR, the handle will not be updated and should not be used.
I2C_Status_t I2C_Read(I2C_Handle_t* handle, uint16_t deviceAddress, uint8_t* data, uint16_t length)
{
    if (!isHandleValid(handle))
    {
        return I2C_INVALID_HANDLE; // Return an error code indicating that the handle is invalid
    }
    if (handle->state != I2C_IDLE)
    {
        return I2C_BUSY; // Return an error code indicating that the I2C bus is busy
    }
    if (length <= 0)
    {
        handle->lastStatus = I2C_INVALID_LENGTH; // Set the last state to invalid length
        return I2C_INVALID_LENGTH; // Return an error code indicating that the length is invalid
    }
    cacheHandle(handle);

    handle->rxBuffer = data;       // Set the receive buffer pointer
    handle->rxBufferSize = length; // Set the receive buffer size
    handle->rxBufferIndex = 0;     // Reset the receive buffer index

    setupDeviceAddress(handle, deviceAddress, true); // Setup the device address for read operation
    PIE7bits.I2C1RXIE = 1;                           // Enable the receive interrupt
    handle->state = I2C_READ;                        // Set the I2C bus state to read mode
    I2C1CNT = (uint8_t)length; // Set the I2C count register to the number of bytes to receive
    I2C1CON0bits.RSEN = 0;     // Disable repeated start condition
    I2C1CON0bits.CSTR = 0;     // Release clock stretching before starting the transfer
    I2C1CON0bits.S = 1;        // Generate a start condition

    handle->lastStatus = I2C_OK; // Set the last state to OK
    return I2C_OK; // Return success status (actual read implementation is not provided)
}

/// @brief Read data from a specific register of an I2C device.  This function is used to read
/// data from a specific register of an I2C device.  The function must first write the register
/// address as a single byte to the define (with the address of the device and the r/w bit cleared).
/// It then generates a repeated start condition and reads the specified number of bytes from the
/// device.
/// @param handle Pointer to the I2C handle structure.
/// @param deviceAddress The I2C address of the device to read from.
/// @param registerAddress The register address to read from.
/// @param data Pointer to the buffer to store the read data.
/// @param length The number of bytes to read from the device.
/// @return I2C status indicating success or failure.  The provided handle will be updated
/// with the read data if the function returns I2C_OK.
I2C_Status_t I2C_ReadRegister(I2C_Handle_t* handle, uint16_t deviceAddress, uint8_t registerAddress,
                              uint8_t* data, uint16_t length)
{
    if (!isHandleValid(handle))
    {
        return I2C_INVALID_HANDLE; // Return an error code indicating that the handle is invalid
    }
    if (handle->state != I2C_IDLE)
    {
        return I2C_BUSY; // Return an error code indicating that the I2C bus is busy
    }
    if (length <= 0)
    {
        handle->lastStatus = I2C_INVALID_LENGTH; // Set the last state to invalid length
        return I2C_INVALID_LENGTH; // Return an error code indicating that the length is invalid
    }
    cacheHandle(handle);

    handle->state = I2C_READ_REGISTER;                // Set the I2C bus state to read register mode
    handle->rxBuffer = data;                          // Set the receive buffer pointer
    handle->rxBufferSize = length;                    // Set the receive buffer size
    handle->rxBufferIndex = 0;                        // Reset the receive buffer index
    setupDeviceAddress(handle, deviceAddress, false); // Setup the device address
    PIE7bits.I2C1TXIE = 1;                            // Enable the transmit interrupt
    I2C1TXB = registerAddress; // Load the register address into the transmit buffer
    I2C1CNT = 1;               // Set the I2C count register to 1 (for the register address)
    // Disable repeated start condition (it will be enabled after the write phase in the ISR)
    I2C1CON0bits.RSEN = 0;
    I2C1CON0bits.CSTR = 0;  // Release clock stretching before starting the transfer
    I2C1CON0bits.S = 1;  // Generate a start condition

    handle->lastStatus = I2C_OK; // Set the last state to OK
    return I2C_OK; // Return success status (actual read register implementation is not provided)
}

/// @brief Reset the I2C module.  This function resets the I2C module by clearing all interrupts
/// and resetting any operations in progress.  The function is defined as follows:
I2C_Status_t I2C_Reset(I2C_Handle_t* handle)
{
    if (!isHandleValid(handle))
    {
        return I2C_INVALID_HANDLE; // Return an error code indicating that the handle is invalid
    }
    cacheHandle(handle);

    // Reset the I2C module based on the channel
    if (handle->channel == I2C_CHANNEL_1)
    {
        CRITICAL_SECTION_START();
        I2C1CON0bits.S = 0;    // Clear the start condition bit
        I2C1CON0bits.EN = 0;   // Disable the I2C module
        PIR7bits.I2C1EIF = 0;  // Clear the I2C1 error interrupt flag
        PIR7bits.I2C1IF = 0;   // Clear the I2C1 general interrupt flag
        PIR7bits.I2C1TXIF = 0; // Clear the I2C1 transmit interrupt flag
        PIR7bits.I2C1RXIF = 0; // Clear the I2C1 receive interrupt flag
        I2C1PIR = 0;           // Clear I2C1 interrupt flags
        I2C1ERR = 0;           // Clear I2C1 error flags
        I2C1CNT = 0;           // Reset I2C1 count register

        handle->state = I2C_IDLE;   // Set the I2C bus state to idle
        handle->lastStatus = I2C_OK; // Set the last state to OK
        CRITICAL_SECTION_END();
        return I2C_OK;
    }

    return I2C_INVALID_CHANNEL;
}

/// @brief Check if the I2C bus is busy.  This function checks the state of the I2C bus and
/// returns an error code indicating whether the bus is busy or idle.  The function is defined
/// as follows:
I2C_Status_t I2C_IsBusy(I2C_Handle_t* handle)
{
    if (!isHandleValid(handle))
    {
        return I2C_INVALID_HANDLE; // Return an error code indicating that the handle is invalid
    }
    cacheHandle(handle);

    if (handle->state != I2C_IDLE)
    {
        return I2C_BUSY; // Return an error code indicating that the I2C bus is busy
    }

