dewayne57/PIC18F__Q43/03 I2C/I2C 02 Module Host/i2c.c
    return I2C_OK; // Return success status indicating that the I2C bus is idle
}

/// @brief Validate the I2C handle structure.  This function checks the signature of the
/// I2C handle structure to ensure that it is valid.  The function returns true if
/// the handle is valid, and false if the handle is invalid.  The function is defined as
/// follows:
static bool isHandleValid(I2C_Handle_t* handle)
{
    if (handle == NULL)
    {
        return false; // Handle is NULL, not valid
    }
    if (handle->signature != I2C_HANDLE_SIGNATURE)
    {
        return false; // Handle signature does not match, not valid
    }
    return true; // Handle is valid
}

/// @brief Setup the I2C device address for read or write operation.  This function sets
/// the I2C device address in the appropriate register based on the I2C channel and the
/// read/write operation.  The function is defined as follows:
static void setupDeviceAddress(I2C_Handle_t* handle, uint16_t deviceAddress, bool read)
{
    uint8_t addressHigh = (deviceAddress >> 8) & 0x03; // Get the upper 2 bits for 10-bit addressing
    uint8_t addressLow = deviceAddress & 0xFF;         // Get the lower 8 bits for 10-bit addressing
    if (read)
    {
        addressLow |= 0x01; // Set the read/write bit for read operation
    }
    else
    {
        addressLow &= ~0x01; // Clear the read/write bit for write operation
    }

#ifdef I2C1CON0
    if (handle->channel == I2C_CHANNEL_1)
    {
        switch (handle->mode)
        {
        case I2C_MODE_MASTER_7:
        case I2C_MULTI_MASTER_7:
            I2C1ADB1 = addressLow; // Set the 7-bit address in the ADB1 register
            break;
        case I2C_MODE_MASTER_10:
        case I2C_MULTI_MASTER_10:
            I2C1ADB1 = addressLow;  // Set the lower 8 bits for 10-bit addressing
            I2C1ADB0 = addressHigh; // Set the upper 2 bits for 10-bit addressing
            break;
        default:
            handle->lastStatus = I2C_INVALID_MODE; // Set the last state to invalid mode
            return;                               // Invalid mode, exit the function
        }
    }
#endif
#ifdef I2C2CON0
    if (handle->channel == I2C_CHANNEL_2)
    {
        switch (handle->mode)
        {
        case I2C_MODE_MASTER_7:
        case I2C_MULTI_MASTER_7:
            I2C2ADB1 = addressLow; // Set the 7-bit address in the ADB1 register
            break;
        case I2C_MODE_MASTER_10:
        case I2C_MULTI_MASTER_10:
            I2C2ADB1 = addressLow;  // Set the lower 8 bits for 10-bit addressing
            I2C2ADB0 = addressHigh; // Set the upper 2 bits for 10-bit addressing
            break;
        default:
            handle->lastStatus = I2C_INVALID_MODE; // Set the last state to invalid mode
            return;                               // Invalid mode, exit the function
        }
    }
#endif
}

/// @brief Handle I2C error interrupts.  This function checks the I2C error interrupt flags
/// and updates the I2C handle structure with the appropriate error state.
/// @param handle Pointer to the I2C handle structure.
/// @return None
static void handleErrorInterrupt(I2C_Handle_t* handle)
{
    if (!isHandleValid(handle))
    {
        return; // Handle is NULL, exit the function
    }

#ifdef I2C1CON0
    if (handle->channel == I2C_CHANNEL_1)
    {
        // Check for bus timeout error
        if (I2C1ERRbits.BTOIF)
        {
            I2C1ERRbits.BTOIF = 0;               // Clear the bus timeout interrupt flag
            handle->lastStatus = I2C_BUS_TIMEOUT; // Set the last state to bus timeout
            handle->state = I2C_IDLE;            // Set the I2C bus state to idle
        }

        // Check for bus collision error
        if (I2C1ERRbits.BCLIF)
        {
            I2C1ERRbits.BCLIF = 0;                 // Clear the bus collision interrupt flag
            handle->lastStatus = I2C_BUS_COLLISION; // Set the last state to bus collision
            handle->state = I2C_IDLE;              // Set the I2C bus state to idle
        }

        // Check for NACK received error
        if (I2C1ERRbits.NACKIF)
        {
            I2C1ERRbits.NACKIF = 0; // Clear the NACK interrupt flag
            handle->lastStatus =
                (I2C_Status_t)I2C_NACK_RECEIVED; // Set the last state to NACK received
            handle->state = I2C_IDLE;            // Set the I2C bus state to idle
        }
    }
#endif
}

/// @brief Handle I2C receive interrupts.  This function reads the received data from the
/// I2C receive buffer and stores it in the I2C handle structure.
/// @param handle Pointer to the I2C handle structure.
/// @return None
void handleReceiveInterrupt(I2C_Handle_t* handle)
{
    if (!isHandleValid(handle))
    {
        return; // Handle is NULL, exit the function
    }

#ifdef I2C1CON0
    if (handle->channel == I2C_CHANNEL_1)
    {
        uint8_t data = I2C1RXB; // Read the receive buffer to clear the interrupt flag
        if (handle->state != I2C_READ)
        {
            return; // Not in read mode, exit the ISR
        }

        if (handle->rxBufferIndex < handle->rxBufferSize)
        {
            handle->rxBuffer[handle->rxBufferIndex++] = data;
        }
    }
#endif
}

/// @brief Handle I2C transmit interrupts.  This function writes the next byte of data to the
/// I2C transmit buffer and updates the I2C handle structure.  If all data has been transmitted,
/// the function disables the transmit interrupt and sets the I2C bus state to idle.  If the
/// function is in read register mode, it switches to read mode after the write phase and enables
/// the receive interrupt.
/// @param handle Pointer to the I2C handle structure.
/// @return None
void handleTransmitInterrupt(I2C_Handle_t* handle)
{
    if (!isHandleValid(handle))
    {
        return; // Handle is NULL, exit the function
    }

    if (handle->state != I2C_WRITE && handle->state != I2C_READ_REGISTER)
    {
        return; // Not in write mode, exit the ISR
    }
    if (handle->txBufferIndex < handle->txBufferSize)
    {
        // There is data to transmit
        I2C1TXB = handle->txBuffer[handle->txBufferIndex++];
        I2C1CON0bits.CSTR = 0;
    }
    else
    {
        if (handle->state == I2C_READ_REGISTER)
        {
            // If we are in read register mode, we need to switch to read mode after the write phase
            handle->state = I2C_READ; // Switch to read mode
            PIE7bits.I2C1RXIE = 1;    // Enable the receive interrupt
            I2C1CNT =
                (uint8_t)handle
                    ->rxBufferSize; // Set the I2C count register to the number of bytes to receive
            I2C1CON0bits.RSEN = 1;  // Enable repeated start condition
            I2C1CON0bits.CSTR = 0;  // Release clock stretching so the repeated start can begin
            I2C1CON0bits.S = 1;     // Generate a start condition for the read phase
        }

        // No more data to transmit, disable the transmit interrupt and set the bus state to idle
        PIE7bits.I2C1TXIE = 0;    // Disable the transmit interrupt
        if (handle->state != I2C_READ)
        {
            handle->state = I2C_IDLE; // Set the bus state to idle
        }
    }
}

/// @brief Cache the I2C handle for the specified channel.
/// @param handle Pointer to the I2C handle structure to be cached.
static void cacheHandle(I2C_Handle_t *handle) {
    if (!isHandleValid(handle)) {
        return;
    }
    if (handle->channel == I2C_CHANNEL_1)
    {
        i2cHandles[0] = handle;
    }
    else if (handle->channel == I2C_CHANNEL_2)
    {
        i2cHandles[1] = handle;
    }
}